app/controllers/users_controller.rb

SELECT  "USERS".* FROM "USERS" WHERE "USERS"."ID" = :a1 AND ROWNUM <= :a2   [["id", 10000], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])

INSERT INTO "USERS" ("NAME", "EMAIL", "CREATED_AT", "UPDATED_AT", "PASSWORD_DIGEST", "ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6)
---
  def create
    # more secure way
    @user = User.new(user_params)
    #@user = User.new(params[:user])    # Not the final implementation!
    # is equivalent to:
    # @user = User.new(name: "Foo Bar", email: "foo@invalid",
    #             password: "foo", password_confirmation: "bar")
    if @user.save